# 하나의 리스트에서 모든 조합을 계산해야 한다면, permutations, combinations를 사용
# 중복된거 다 계산
items = ['1','2','3','4','5']
from itertools import permutations
list(permutations(items,2))
# [('1', '2'), ('1', '3'), ('1', '4'), ('1', '5'), ('2', '1'), ('2', '3'), ('2', '4'), ('2', '5'), ('3', '1'), ('3', '2'), ('3', '4'), ('3', '5'), ('4', '1'), ('4', '2'), ('4', '3'), ('4', '5'), ('5', '1'), ('5', '2'), ('5', '3'), ('5', '4')]

# 중복된것 제거
from itertools import combinations
list(combinations(items,2))
# [('1', '2'), ('1', '3'), ('1', '4'), ('1', '5'), ('2', '3'), ('2', '4'), ('2', '5'), ('3', '4'), ('3', '5'), ('4', '5')]
